---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures.ElementPropLinkCircularChainError
source: html/37f10154-6541-6219-7b1e-c01812233f14.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures.ElementPropLinkCircularChainError Property

Linked properties in highlighted elements cause a circular chain of references.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementPropLinkCircularChainError { get; }
```